# Taps
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/dupes'
tap 'homebrew/core'
tap 'homebrew/fuse'
tap 'homebrew/completions'
tap 'homebrew/science'

# Mount filesystems
cask 'osxfuse'
brew 'homebrew/fuse/sshfs'

# OSX Updates
brew 'coreutils'        # GNU up-to-date coreutils
brew 'findutils'        # GNU 'find', 'locate', etc

# Completions
brew 'bash-completion'
brew 'brew-cask-completion'
brew 'open-completion'
brew 'pip-completion'

# Build Tools
brew 'autoconf'
brew 'automake'
brew 'cctools'
brew 'cmake'
brew 'fontconfig'
brew 'gcc' 
brew 'pkg-config'

# Basics
brew 'bash'       # Newest bash version
brew 'pandoc'     # Document conversions
brew 'wget'
brew 'stow'

## Make sure cask installs apps in '/Applications'
cask_args appdir: '/Applications'

# Casked Apps
cask 'dropbox'
cask 'java'
cask 'mactex'
cask 'sublime-text'
cask 'telegram'
cask 'vlc'
cask 'xquartz'
cask 'spotify'
cask 'silverlight'

# Quicklook plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'

# Misc
brew 'cfitsio'
brew 'freetype'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'glib'
brew 'gnuplot'
brew 'jpeg'
brew 'libbson'
brew 'libffi'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libyaml'
brew 'lua'
brew 'openssl'
brew 'pcre'
brew 'qt'
brew 'readline'
brew 'ruby'
brew 'sqlite'
brew 'webp'
brew 'xz'
